#Задача 5: Числовая пирамида
print("Введите высоту пирамиды(целое число от 1 до 9)")
n = int(input())
k= "123456789"
kn = k[:n]
for i in range(1,n+1):
    l = " "
    print(l*(n-i) +kn[:i] + (kn[:i-1])[::-1])
    
